import DiaryList from '@/components/DiaryList/DiaryList';
import React from 'react';
import css from './page.module.css';
import DiaryEntryDetails from '@/components/DiaryEntryDetails/DiaryEntryDetails';

const data = [
  {
    _id: Math.floor(10000 + Math.random() * 90000),
    title: 'Перший привіт',
    description:
      'Це сталося! Сьогодні ввечері, коли я спокійно дивилася фільм, я це відчула. Спочатку подумала, що здалося. Такий ледь вловимий поштовх зсередини, ніби хтось легенько постукав. Я завмерла, поклала руку на живіт і стала чекати. І за хвилину — знову! Я розплакалась від щастя. Це перше справжнє «привіт» від мого малюка. Покликала чоловіка, він довго тримав руку на животі, і йому теж пощастило відчути один поштовх. Його очі в цей момент — я ніколи не забуду. Тепер я точно знаю, що я не сама. Там справді хтось є, росте і спілкується зі мною. Неймовірне відчуття.',
    createdAt: '9 липня 2025',
    emotions: ['Натхнення', 'дивні бажання', 'Любов'],
  },
  {
    _id: Math.floor(10000 + Math.random() * 90000),
    title: 'Дивне бажання',
    description:
      'Це сталося! Сьогодні ввечері, коли я спокійно дивилася фільм, я це відчула. Спочатку подумала, що здалося. Такий ледь вловимий поштовх зсередини, ніби хтось легенько постукав. Я завмерла, поклала руку на живіт і стала чекати. І за хвилину — знову! Я розплакалась від щастя. Це перше справжнє «привіт» від мого малюка. Покликала чоловіка, він довго тримав руку на животі, і йому теж пощастило відчути один поштовх. Його очі в цей момент — я ніколи не забуду. Тепер я точно знаю, що я не сама. Там справді хтось є, росте і спілкується зі мною. Неймовірне відчуття.',
    createdAt: '9 липня 2025',
    emotions: ['Натхнення', 'дивні бажання', 'Любов'],
  },
  {
    _id: Math.floor(10000 + Math.random() * 90000),
    title: 'Дивне бажання',
    description:
      'Це сталося! Сьогодні ввечері, коли я спокійно дивилася фільм, я це відчула. Спочатку подумала, що здалося. Такий ледь вловимий поштовх зсередини, ніби хтось легенько постукав. Я завмерла, поклала руку на живіт і стала чекати. І за хвилину — знову! Я розплакалась від щастя. Це перше справжнє «привіт» від мого малюка. Покликала чоловіка, він довго тримав руку на животі, і йому теж пощастило відчути один поштовх. Його очі в цей момент — я ніколи не забуду. Тепер я точно знаю, що я не сама. Там справді хтось є, росте і спілкується зі мною. Неймовірне відчуття.',
    createdAt: '9 липня 2025',
    emotions: ['Натхнення', 'дивні бажання', 'Любов'],
  },
  {
    _id: Math.floor(10000 + Math.random() * 90000),
    title: 'Дивне бажання',
    description:
      'Це сталося! Сьогодні ввечері, коли я спокійно дивилася фільм, я це відчула. Спочатку подумала, що здалося. Такий ледь вловимий поштовх зсередини, ніби хтось легенько постукав. Я завмерла, поклала руку на живіт і стала чекати. І за хвилину — знову! Я розплакалась від щастя. Це перше справжнє «привіт» від мого малюка. Покликала чоловіка, він довго тримав руку на животі, і йому теж пощастило відчути один поштовх. Його очі в цей момент — я ніколи не забуду. Тепер я точно знаю, що я не сама. Там справді хтось є, росте і спілкується зі мною. Неймовірне відчуття.',
    createdAt: '9 липня 2025',
    emotions: ['Натхнення', 'дивні бажання', 'Любов'],
  },
  {
    _id: Math.floor(10000 + Math.random() * 90000),
    title: 'Дивне бажання',
    description:
      'Це сталося! Сьогодні ввечері, коли я спокійно дивилася фільм, я це відчула. Спочатку подумала, що здалося. Такий ледь вловимий поштовх зсередини, ніби хтось легенько постукав. Я завмерла, поклала руку на живіт і стала чекати. І за хвилину — знову! Я розплакалась від щастя. Це перше справжнє «привіт» від мого малюка. Покликала чоловіка, він довго тримав руку на животі, і йому теж пощастило відчути один поштовх. Його очі в цей момент — я ніколи не забуду. Тепер я точно знаю, що я не сама. Там справді хтось є, росте і спілкується зі мною. Неймовірне відчуття.',
    createdAt: '9 липня 2025',
    emotions: ['Натхнення', 'дивні бажання', 'Любов'],
  },
  {
    _id: Math.floor(10000 + Math.random() * 90000),
    title: 'Дивне бажання',
    description:
      'Це сталося! Сьогодні ввечері, коли я спокійно дивилася фільм, я це відчула. Спочатку подумала, що здалося. Такий ледь вловимий поштовх зсередини, ніби хтось легенько постукав. Я завмерла, поклала руку на живіт і стала чекати. І за хвилину — знову! Я розплакалась від щастя. Це перше справжнє «привіт» від мого малюка. Покликала чоловіка, він довго тримав руку на животі, і йому теж пощастило відчути один поштовх. Його очі в цей момент — я ніколи не забуду. Тепер я точно знаю, що я не сама. Там справді хтось є, росте і спілкується зі мною. Неймовірне відчуття.',
    createdAt: '9 липня 2025',
    emotions: ['Натхнення', 'дивні бажання', 'Любов'],
  },
  {
    _id: Math.floor(10000 + Math.random() * 90000),
    title: 'Дивне бажання',
    description:
      'Це сталося! Сьогодні ввечері, коли я спокійно дивилася фільм, я це відчула. Спочатку подумала, що здалося. Такий ледь вловимий поштовх зсередини, ніби хтось легенько постукав. Я завмерла, поклала руку на живіт і стала чекати. І за хвилину — знову! Я розплакалась від щастя. Це перше справжнє «привіт» від мого малюка. Покликала чоловіка, він довго тримав руку на животі, і йому теж пощастило відчути один поштовх. Його очі в цей момент — я ніколи не забуду. Тепер я точно знаю, що я не сама. Там справді хтось є, росте і спілкується зі мною. Неймовірне відчуття.',
    createdAt: '9 липня 2025',
    emotions: ['Натхнення', 'дивні бажання', 'Любов'],
  },
];

const DiaryPage = () => {
  return (
    <div className={css.diaryContainer}>
      <DiaryList diaryData={data} />
      <DiaryEntryDetails entryData={data[0]} />
    </div>
  );
};

export default DiaryPage;
